FV2510/E_0034.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">7.28.1: AD: Aktivierung eines MaBiS-Zählpunkts für die Bilanzkreissummenzeitreihe vom NB an BIKO und BKV</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0034</B><BR align="left"/><FONT>Prüfende Rolle: <B>BIKO</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>1: </B>Erfolgt die Aktivierung nach Ablauf der Clearingfrist für die KBKA?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>2: </B>Erfolgt die Aktivierung zum Monatsersten 00:00 Uhr?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Gewählter Zeitpunkt nicht zulässig<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>3: </B>Ist die richtige Regelzone angegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Regelzone falsch<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>4: </B>Ist das Bilanzierungsgebiet zum Aktivierungsbeginn in der Regelzone des BIKO gültig?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Bilanzierungsgebiet nicht gültig<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>5: </B>Ist der Sender zum Aktivierungsbeginn der verantwortliche NB für das angegebene<BR align="left"/>Bilanzierungsgebiet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Keine Berechtigung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>6: </B>Existiert bereits ein abweichendes Tupel aus Bilanzierungsgebiet, Bilanzkreis<BR align="left"/>und ZRT unter der ID des MaBiS-ZP?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A06" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A06</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Abweichender MaBiS-ZP bereits vorhanden<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>7: </B>Existiert bereits für das genannte Tupel aus Bilanzierungsgebiet, Bilanzkreis<BR align="left"/>und ZRT eine abweichende ID des MaBiS-ZP?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A07" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A07</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Abweichende ID zum MaBiS-ZP bereits vorhanden<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>8: </B>Ist der Bilanzkreis zum Aktivierungsbeginn gültig?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A08" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A08</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Bilanzkreis nicht gültig<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>9: </B>Ist der NB zur Aktivierung des ZRT berechtigt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A09" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A09</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>ZRT Aktivierung nicht berechtigt<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Passt die OBIS-Kennzahl zum ZRT?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A10</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>OBIS nicht passend<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>11: </B>Ist der MaBiS-ZP zum Zeitpunkt der Aktivierung bereits aktiviert?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A11</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>MaBiS-ZP bereits aktiviert<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A12" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A12</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/>Aktivierung durchgeführt<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "1" [color="#88a0d6"];
    "1" -> "A01" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "1" -> "2" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "A02" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "3" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "A03" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "4" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "4" -> "A04" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "4" -> "5" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "5" -> "A05" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "5" -> "6" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "6" -> "A06" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "6" -> "7" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "7" -> "A07" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "7" -> "8" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "8" -> "A08" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "8" -> "9" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "9" -> "A09" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "9" -> "10" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "A10" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "11" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "11" -> "A11" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "11" -> "A12" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
